# デバッギング

どんなに Vagrant が安定でバグのない状態を維持しても、問題が発生して Vagrant が予期しない動作をすることは避けられません。このような場合、 Vagrant はユーザーを支援する素晴らしい[サポート](http://www.vagrantup.com/support.html)チャンネルを持っています。

これらのサポートチャネルを使用するときは、エラーレポートにデバッグログを含めておくと一般的に役立ちます。これらのログは発生した問題のトラブルシューティングに役立ちます。

詳細なログ出力を有効にするには、環境変数 `VAGRANT_LOG` に目的のログレベルの名前を設定します。ログレベルには次のようなものがあります。 `debug` （うるさい）、 `info` （普通）、 `warn` （静か）、 `error` （非常に静か）。サポートを求めるときは、 `debug` を設定してください。自分でトラブルシューティングするときは、 `info` から始めるべきです。この場合、多くの情報は出力されませんが、 Vagrant の動作に関する重要な情報が含まれています。

Linux と Mac では `vagrant` コマンドの前に環境変数宣言を設定することができます：

```
$ VAGRANT_LOG=info vagrant up
...
```

Windows では複数のステップが必要です。

```
$ set VAGRANT_LOG=info
$ vagrant up
...
```

バグレポートの提出を考えている場合、 [gist](https://gist.github.com/) や他のペーストサービスを使ったレポートと一緒にデバッグレベルのログを提出してください。

